<script setup lang="ts">
const text = `
      Набойщиков Артемий
      а&nbsp;а&nbsp;а&nbsp;а&nbsp;а&nbsp;аа&nbsp;а&nbsp;а&nbsp;а&nbsp;а&nbsp;аа&nbsp;а&nbsp;а&nbsp;а&nbsp;а&nbsp;а<br/>
      б&nbsp;б&nbsp;б&nbsp;б&nbsp;б&nbsp;бб&nbsp;б&nbsp;б&nbsp;б&nbsp;б&nbsp;бб&nbsp;б&nbsp;б&nbsp;б&nbsp;б&nbsp;б          
      1.Раскройте понятие деловой коммуникации.
      Деловая коммуникация — это целенаправленный процесс обмена информацией, который происходит в рамках профессиональной среды. Основная цель деловой коммуникации — достижение конкретных бизнес-целей, таких как принятие решений, выполнение задач, улучшение рабочих процессов и поддержание деловых отношений.
      Ключевые характеристики деловой коммуникации включают:
      Целенаправленность: Коммуникация осуществляется для достижения конкретной цели, связанной с рабочим процессом или бизнес-интересами.
      Официальность: В деловой коммуникации важно соблюдать профессиональные нормы, этику и правила взаимодействия, особенно при общении с клиентами, руководителями или деловыми партнерами.
      Регламентированность: Часто используется определенный формат общения — деловые письма, отчеты, протоколы, что упрощает интерпретацию и обеспечивает понимание.
      Структурированность и фактическая точность: Деловое общение должно быть ясным, лаконичным и точным, исключая эмоциональные или ненужные детали, так как это повышает вероятность успешного восприятия.

      2. В чем отличие деловой коммуникации от других форм коммуникаций. Опишите их общие и отличительные черты.
      Общие черты между деловой и другими видами коммуникаций:
      Используются как вербальные (речь, текст), так и невербальные (мимика, жесты) средства передачи информации.
      Подразумевает активное слушание, чтобы улавливать не только слова, но и подтекст.
      Требует взаимного уважения и понимания, чтобы укрепить доверие и уменьшить барьеры.
      Отличительные черты деловой коммуникации:
      Цель: В деловой коммуникации цель более прагматичная и ясная (решение задач, достижение договоренностей). В личной коммуникации цель может быть размытой — поддержание дружеских связей или обмен эмоциями.
      Форма и стиль: Деловая коммуникация требует официального стиля, ограниченного определенными нормами (официальное обращение, деловой тон). В неформальной коммуникации форма и стиль часто свободные, допускается использование жаргона или сокращений.
      Эмоциональный контекст: Деловая коммуникация в большей степени ориентирована на факты, а личная или бытовая — на эмоции, где важна поддержка или эмоциональная связь.
      Среда и участники: В деловой коммуникации обычно участвуют коллеги, клиенты, партнеры, и она происходит в рамках бизнеса, тогда как личная коммуникация проходит в более расслабленной обстановке.

      3. Опишите виды и формы деловой коммуникации и их специфику
      Виды деловой коммуникации:
      Вербальная:
      Устная: Проводится через переговоры, встречи, презентации, собрания. Этот тип общения важен для оперативного обсуждения и принятия решений, так как позволяет задать вопросы и сразу уточнить детали.
      Письменная: Охватывает все виды текстовых сообщений (отчеты, письма, договора, электронные сообщения). Важно, чтобы она была структурированной и понятной, так как фиксируется в письменной форме и может храниться как документ.
      Невербальная:
      Жесты и мимика: Поддержка слов с помощью жестов, зрительного контакта, что помогает воспринимать намерения и настроение собеседника.
      Интонация и паузы: Могут усилить или ослабить значение сказанного, передать отношение к информации.
      Формы деловой коммуникации:
      Переговоры: Формальное общение с целью достижения соглашений между сторонами. Включает обсуждение интересов, согласование условий и уточнение деталей.
      Интервью: Используется при подборе персонала или оценке работы сотрудников, а также при сборе информации.
      Совещания: Обсуждения в группах, направленные на выработку коллективных решений и обмен мнениями.
      Презентации: Публичное представление информации с использованием визуальных и вербальных средств, обычно для представления проектов или результатов работы.
      Беседы и собрания: Менее формальные виды встреч, направленные на обсуждение текущих вопросов, обмен мнениями и укрепление деловых связей.
      Публичные выступления: Представление информации перед аудиторией, обычно с целью донесения важной информации или мотивирования участников к действиям.

      4.Основные проблемные точки коммуникации, где они возникают.
      Проблемы в деловой коммуникации могут возникать на каждом этапе передачи информации, от формулировки и отправки сообщения до его восприятия и интерпретации. Проблемные точки включают:
      Неясность целей и задач: Если цели общения или обсуждения неясны, это приводит к разным трактовкам, которые усложняют понимание.
      Неполная или устаревшая информация: Если сообщение содержит недостаточно данных, это препятствует принятию обоснованных решений.
      Выбор неподходящего канала: Коммуникация может страдать от использования неэффективного канала, когда, например, длинные обсуждения ведутся по электронной почте, а не на встрече.
      Неточности формулировок: Двусмысленные слова или фразы могут быть неверно истолкованы, особенно при письменной передаче, когда контекст ограничен.
      Различия в восприятии: Каждый человек воспринимает информацию сквозь призму личного опыта, культурных и профессиональных убеждений, что может вызывать искажение передаваемого сообщения.

      5.Основные типы коммуникативных барьеров. Их различие и сходство.
      Языковые барьеры:
      Возникают из-за недостаточного владения языком, различных акцентов, профессионального или технического сленга. Могут затруднить взаимопонимание, особенно в международной среде, где сотрудники из разных стран общаются на неродном языке.
      Культурные барьеры:
      Связаны с различиями в культурных особенностях, традициях и нормах общения. Например, в некоторых культурах вопросы, касающиеся личной жизни, считаются неприемлемыми, тогда как в других такие вопросы используются для создания доверительной атмосферы.
      Психологические барьеры:
      Включают стереотипы, предвзятость, эмоциональные состояния (стресс, страх) и личные установки, которые могут негативно повлиять на восприятие и интерпретацию информации. Например, предвзятое мнение о коллеге может мешать объективной оценке его предложений.
      Физические барьеры:
      Включают такие факторы, как расстояние, технические ограничения (плохая связь), шум или неудобное расположение участников. Например, физическое расстояние может снижать чувство сопричастности и эффективность взаимодействия.
      Сходства: Все барьеры усложняют процесс передачи и восприятия информации, требуют времени и усилий на преодоление.
      Различия: Барьеры отличаются по природе и способам преодоления:
      Языковые требуют адаптации речи или использования перевода.
      Культурные требуют повышения осведомленности о культурных особенностях.
      Психологические связаны с работой над личными установками, уменьшением стрессовых факторов.
      Физические могут быть решены через техническое оснащение или создание комфортной среды для общения.
`

const words = text.split(' ').map(word => ({
  isAlt: Boolean(Math.random() > 0.5),
  word,
}))
</script>

<template>
  <!-- write some text in russian -->
  <div class="container">
    <div class="row">
      <div class="col-md-12">
        <h1>Artistic</h1>
      </div>
    </div>
    <p>This is the artistic page</p>
    <p>
      <span
        v-for="word in words"
        :key="word.word"
        :class="{ alt: word.isAlt }"
        v-html="word.word"
      />
    </p>
  </div>
</template>

<style scoped>
.container {
  font-family: 'Artistick', serif;
  font-feature-settings:  "dlig";
}

.alt {
  font-feature-settings: 'dlig' 'salt' 'aalt';
}
</style>
